/*
 * Thermometer(coursework).cpp
 *
 * Created: 18.04.2023 14:47:15
 * Author : Косяков Денис Александрович
 * Наименование прибора: Термометр на базе платинового
 * термопреобразователя сопротивления
 * 
 * Диапазон измерений: [-200; 600] °C
 * Отображаемые  параметры:
 *	 - Температура (с разрешающей способностью 0.1 °С) в различных единицах измерения (не менее трех)
 * Особенности: 
 *	 - Обеспечивается возможность считывания показаний прибора по интерфейсу USB (протокол Modbus-RTU)
 */ 

#include <avr/io.h>
#include <avr/interrupt.h>

int main(void)
{
    /* Replace with your application code */
    while (1) 
    {
    }
}

